----------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/doheun/Documents/Stata/IODS_2025/output/log/merge.log
  log type:  text
 opened on:   9 Dec 2025, 15:46:24

. 
. use "./final_data/pv31.dta", clear 

. 
. ** 1. 키 변수(pid, year)를 기준으로 1:1 merge 실행
. merge 1:1 pid year using "./final_data/mdv31.dta"

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                            38,545  (_merge==3)
    -----------------------------------------

. 
. // 합치기 결과 확인
. tabulate _merge

   Matching result from |
                  merge |      Freq.     Percent        Cum.
------------------------+-----------------------------------
            Matched (3) |     38,545      100.00      100.00
------------------------+-----------------------------------
                  Total |     38,545      100.00

. 
. drop _merge

. 
. ** 2. household data와 personal data를 merge
. merge m:1 hid year using "./final_data/hv31.dta"

    Result                      Number of obs
    -----------------------------------------
    Not matched                            68
        from master                        68  (_merge==1)
        from using                          0  (_merge==2)

    Matched                            38,477  (_merge==3)
    -----------------------------------------

. 
. 
. ** personal과 diary는 응답했으나 household survey의 응답하지 않은 경우 
. drop if _merge == 1 
(68 observations deleted)

. drop _merge

. 
. 
. ** weekend 변수 labeling 변경
. label define D_weekend 0 "주중" 1 "주말"

. 
. forvalues num = 1/3 {
  2.         replace D_weekend`num' = (D_weekend`num' == 2)
  3.         label values D_weekend`num' D_weekend
  4. }
(38,477 real changes made)
(38,477 real changes made)
(38,477 real changes made)

. 
. tab D_weekend1

1 D_weekend |      Freq.     Percent        Cum.
------------+-----------------------------------
       주중 |     28,286       73.51       73.51
       주말 |     10,191       26.49      100.00
------------+-----------------------------------
      Total |     38,477      100.00

. tab D_weekend2

2 D_weekend |      Freq.     Percent        Cum.
------------+-----------------------------------
       주중 |     27,695       71.98       71.98
       주말 |     10,782       28.02      100.00
------------+-----------------------------------
      Total |     38,477      100.00

. tab D_weekend3

3 D_weekend |      Freq.     Percent        Cum.
------------+-----------------------------------
       주중 |     27,312       70.98       70.98
       주말 |     11,165       29.02      100.00
------------+-----------------------------------
      Total |     38,477      100.00

. 
. ** 배우자의 유무 
. gen spouse = (mar == 2)

. label define spouse_label 0 "배우자 없음" 1 "배우자 있음"

. label values spouse spouse_label

. label variable spouse "배우자의 유무"

. 
. ** employment type
. gen employment_type = job2
(16,185 missing values generated)

. replace employment_type = 0 if employment_type ==.
(16,185 real changes made)

. replace employment_type = 0 if employment_type == 4
(836 real changes made)

. label define employment_type_label 0 "무직" 1 "임근 근로자" 2 "고용주" 3 "단독 자영업자"

. 
. label values employment_type employment_type_label

. label variable employment_type "고용 형태"

. 
. ** wage 변수 추가
. gen wage = .
(38,477 missing values generated)

. 
. forvalues num = 2/18{
  2.         replace wage = (`num'-2)*50 + 25 if income1 == `num' // 설문 항목의 중간값을 선정
  3. }
(2,706 real changes made)
(2,516 real changes made)
(1,629 real changes made)
(3,122 real changes made)
(3,499 real changes made)
(4,614 real changes made)
(2,601 real changes made)
(2,429 real changes made)
(1,018 real changes made)
(961 real changes made)
(632 real changes made)
(272 real changes made)
(141 real changes made)
(98 real changes made)
(62 real changes made)
(42 real changes made)
(161 real changes made)

. replace wage = 0 if income1 == 1 // 소득 없음
(11,974 real changes made)

. 
. label variable wage "개인 월평균 소득 (항목별 중간, 만원)"

. 
. tab wage

       개인 |
     월평균 |
       소득 |
    (항목별 |
      중간, |
      만원) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     11,974       31.12       31.12
         25 |      2,706        7.03       38.15
         75 |      2,516        6.54       44.69
        125 |      1,629        4.23       48.93
        175 |      3,122        8.11       57.04
        225 |      3,499        9.09       66.13
        275 |      4,614       11.99       78.12
        325 |      2,601        6.76       84.88
        375 |      2,429        6.31       91.20
        425 |      1,018        2.65       93.84
        475 |        961        2.50       96.34
        525 |        632        1.64       97.98
        575 |        272        0.71       98.69
        625 |        141        0.37       99.06
        675 |         98        0.25       99.31
        725 |         62        0.16       99.47
        775 |         42        0.11       99.58
        825 |        161        0.42      100.00
------------+-----------------------------------
      Total |     38,477      100.00

. 
. ** 미디어 디지털 컨텐츠 비용 변수 
. ds *_payment
tvod_payment  evod_payment  music_paym~t  etc_payment
svod_payment  contents_p~t  game_payment

. local payment_vars "`r(varlist)'"

. di "`payment_vars'"
tvod_payment svod_payment evod_payment contents_payment music_payment game_payment etc_payment

. 
. foreach var of varlist `payment_vars' {
  2.     forvalues num = 1/8{
  3.                 replace `var' = 0.5 * ( (2*`num') -1 ) * 0.5 if `var' == `num' // 설문 항
> 목의 중간값을 선정 단위 만원
  4.         }
  5.         replace `var' = 0 if `var' == .
  6.         tab `var'
  7. }
(139 real changes made)
(186 real changes made)
(228 real changes made)
(58 real changes made)
(38 real changes made)
(13 real changes made)
(17 real changes made)
(4 real changes made)
(37,794 real changes made)

            OTT 서비스 |
           월평균 지출 |
           금액 - 건당 |
     결제형(TVOD)(리코 |
                   드) |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                     0 |     37,794       98.22       98.22
                   .25 |        139        0.36       98.59
                   .75 |        186        0.48       99.07
                  1.25 |        228        0.59       99.66
                  1.75 |         58        0.15       99.81
                  2.25 |         38        0.10       99.91
                  2.75 |         13        0.03       99.95
                  3.25 |         17        0.04       99.99
                  3.75 |          4        0.01      100.00
-----------------------+-----------------------------------
                 Total |     38,477      100.00
(1,323 real changes made)
(1,865 real changes made)
(3,970 real changes made)
(1,570 real changes made)
(515 real changes made)
(198 real changes made)
(171 real changes made)
(114 real changes made)
(28,751 real changes made)

            OTT 서비스 |
           월평균 지출 |
       금액 - 월정액제 |
     가입형(SVOD)(리코 |
                   드) |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                     0 |     28,751       74.72       74.72
                   .25 |      1,323        3.44       78.16
                   .75 |      1,865        4.85       83.01
                  1.25 |      3,970       10.32       93.33
                  1.75 |      1,570        4.08       97.41
                  2.25 |        515        1.34       98.74
                  2.75 |        198        0.51       99.26
                  3.25 |        171        0.44       99.70
                  3.75 |        114        0.30      100.00
-----------------------+-----------------------------------
                 Total |     38,477      100.00
(2,467 real changes made)
(88 real changes made)
(150 real changes made)
(76 real changes made)
(93 real changes made)
(31 real changes made)
(95 real changes made)
(684 real changes made)
(34,793 real changes made)

         온라인 디지털 |
         콘텐츠 월평균 |
            지출금액 - |
       교육동영상(리코 |
                   드) |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                     0 |     34,793       90.43       90.43
                   .25 |      2,467        6.41       96.84
                   .75 |         88        0.23       97.07
                  1.25 |        150        0.39       97.46
                  1.75 |         76        0.20       97.65
                  2.25 |         93        0.24       97.89
                  2.75 |         31        0.08       97.98
                  3.25 |         95        0.25       98.22
                  3.75 |        684        1.78      100.00
-----------------------+-----------------------------------
                 Total |     38,477      100.00
(9,193 real changes made)
(338 real changes made)
(583 real changes made)
(50 real changes made)
(70 real changes made)
(11 real changes made)
(49 real changes made)
(69 real changes made)
(28,114 real changes made)

         디지털 콘텐츠 |
       월평균 지출금액 |
              - 온라인 |
     뉴스/잡지/E-book( |
           웹툰/웹소설 |
         포함)(리코드) |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                     0 |     28,114       73.07       73.07
                   .25 |      9,193       23.89       96.96
                   .75 |        338        0.88       97.84
                  1.25 |        583        1.52       99.35
                  1.75 |         50        0.13       99.48
                  2.25 |         70        0.18       99.66
                  2.75 |         11        0.03       99.69
                  3.25 |         49        0.13       99.82
                  3.75 |         69        0.18      100.00
-----------------------+-----------------------------------
                 Total |     38,477      100.00
(8,670 real changes made)
(2,292 real changes made)
(1,407 real changes made)
(109 real changes made)
(23 real changes made)
(5 real changes made)
(9 real changes made)
(20 real changes made)
(25,942 real changes made)

         온라인 디지털 |
         콘텐츠 월평균 |
            지출금액 - |
          음악(리코드) |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                     0 |     25,942       67.42       67.42
                   .25 |      8,670       22.53       89.96
                   .75 |      2,292        5.96       95.91
                  1.25 |      1,407        3.66       99.57
                  1.75 |        109        0.28       99.85
                  2.25 |         23        0.06       99.91
                  2.75 |          5        0.01       99.92
                  3.25 |          9        0.02       99.95
                  3.75 |         20        0.05      100.00
-----------------------+-----------------------------------
                 Total |     38,477      100.00
(6,496 real changes made)
(308 real changes made)
(304 real changes made)
(64 real changes made)
(92 real changes made)
(29 real changes made)
(102 real changes made)
(195 real changes made)
(30,887 real changes made)

         온라인 디지털 |
         콘텐츠 월평균 |
            지출금액 - |
          게임(리코드) |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                     0 |     30,887       80.27       80.27
                   .25 |      6,496       16.88       97.16
                   .75 |        308        0.80       97.96
                  1.25 |        304        0.79       98.75
                  1.75 |         64        0.17       98.91
                  2.25 |         92        0.24       99.15
                  2.75 |         29        0.08       99.23
                  3.25 |        102        0.27       99.49
                  3.75 |        195        0.51      100.00
-----------------------+-----------------------------------
                 Total |     38,477      100.00
(151 real changes made)
(5 real changes made)
(5 real changes made)
(3 real changes made)
(0 real changes made)
(0 real changes made)
(2 real changes made)
(0 real changes made)
(38,311 real changes made)

         온라인 디지털 |
         콘텐츠 월평균 |
            지출금액 - |
          기타(리코드) |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                     0 |     38,311       99.57       99.57
                   .25 |        151        0.39       99.96
                   .75 |          5        0.01       99.97
                  1.25 |          5        0.01       99.99
                  1.75 |          3        0.01       99.99
                  3.25 |          2        0.01      100.00
-----------------------+-----------------------------------
                 Total |     38,477      100.00

. 
. ** 인당 미디어 지출 변수 생성
. gen OTT_payment = svod_payment + tvod_payment

. label variable OTT_payment "OTT 전체 월평균 지출 (항목별 중간, 만원)"

. gen other_media_payment = evod_payment + contents_payment + music_payment + game_payment + e
> tc_payment

. label variable other_media_payment "OTT 제외 미디어 월평균 지출 (항목별 중간, 만원)"

. 
. ** 비율 변수 생성
. forvalues num = 1/3{
  2.         
.         // 비수면 시간
.         gen non_sleep_hour`num' = OTT_hour`num' + composite_hour`num' + working_hour`num' + 
> media_hour`num'
  3.         label variable non_sleep_hour`num' "[`num'일차] 비수면 시간 (15분 단위 측정 결과)
> "
  4.         
.         // 전체 미디어 사용 시간
.         gen total_media_hour`num' = OTT_hour`num' + media_hour`num'
  5.         label variable total_media_hour`num' "[`num'일차] 전체 미디어 사용 시간 (15분 단
> 위 측정 결과)"
  6.         
.         // 비수면 시간 중 OTT 시청 시간의 비중
.         gen L_OTT`num' = OTT_hour`num' / non_sleep_hour`num'
  7.         label variable L_OTT`num' "[`num'일차] 비수면 시간 중 OTT 시청 시간의 비중"
  8.         
.         // 비수면 시간 중 일하는 시간의 비중
.         gen H`num' = working_hour`num' / non_sleep_hour`num'
  9.         label variable H`num' "[`num'일차] 비수면 시간 중 일하는 시간의 비중"
 10.         
.         // 비수면 시간 중 나머지 복합 시간의 비중
.         gen L_composite`num' = composite_hour`num' / non_sleep_hour`num'
 11.         label variable L_composite`num' "[`num'일차] 비수면 시간 중 나머지 복합 시간의 비
> 중"
 12.         
.         // 비수면 시간 중 OTT를 제외한 미디어 사용 시간의 비중
.         gen L_media`num' = media_hour`num' / non_sleep_hour`num'
 13.         label variable L_media`num' "[`num'일차] 비수면 시간 중 OTT를 제외한 미디어 사용 
> 시간의 비중"
 14.         
.         // 전체 미디어 사용시간 중 OTT 시청시간의 비중
.         gen m_OTT`num' = OTT_hour`num' / total_media_hour`num'
 15.         label variable m_OTT`num' "[`num'일차] 전체 미디어 사용시간 중 OTT 시청시간의 비
> 중"
 16.         
.         // 전체 미디어 사용시간 중 OTT를 제외한 미디어 사용시간의 비중
.         gen m_media`num' = media_hour`num' / total_media_hour`num'
 17.         label variable m_media`num' "[`num'일차] 전체 미디어 사용시간 중 OTT를 제외한 미
> 디어 사용시간의 비중"
 18. }
(196 missing values generated)
(196 missing values generated)
(160 missing values generated)
(160 missing values generated)
(156 missing values generated)
(156 missing values generated)

. 
. 
. gen log_total_media_hour1 = ln(total_media_hour1)
(196 missing values generated)

. gen log_total_media_hour2 = ln(total_media_hour2)
(160 missing values generated)

. gen log_total_media_hour3 = ln(total_media_hour3)
(156 missing values generated)

. 
. 
. ** log wage로 변경 
. gen lnWage = ln(wage)
(11,974 missing values generated)

. drop if lnWage == . // 소득이 없는 사람들은 배제, 분석은 소득이 기회비용인 사람들로 한함.
(11,974 observations deleted)

. 
. ** Money intensity 계산을 위한 변수
. forvalues num = 1/3{
  2.         // [0,1] 사이에 정의되기 위해서 소비시간이 있거나 유료구독을 하는 경우만을 포함하
> 여 평균
.         gen alpha_O`num' = OTT_payment / ( OTT_payment + wage*L_OTT`num') if L_OTT`num' > 0 
> | OTT_payment > 0
  3.         
.         // [0,1] 사이에 정의되기 위해서 소비시간이 있거나 유료결제를 하는 경우만을 포함하여 
> 평균
.         gen alpha_I`num' = other_media_payment / (other_media_payment + wage*L_media`num') i
> f L_media`num' > 0 | other_media_payment > 0
  4. }
(15,967 missing values generated)
(194 missing values generated)
(15,834 missing values generated)
(169 missing values generated)
(15,995 missing values generated)
(169 missing values generated)

. 
. ** 다이어리 데이터 기록달과 연도를 엮어서 시간변수 생성 
. egen year_month1 = group(year D_mm1)

. egen year_month2 = group(year D_mm2)

. egen year_month3 = group(year D_mm3)

. 
. ** 변수 순서 조정 및 정렬
. order d26*, last

. 
. order pid hid year

. 
. sort pid year

. 
. xtset pid year

Panel variable: pid (unbalanced)
 Time variable: year, 21 to 24, but with gaps
         Delta: 1 unit

. 
. xtdescribe

     pid:  10001, 10003, ..., 1.183e+08                      n =       8275
    year:  21, 22, ..., 24                                   T =          4
           Delta(year) = 1 unit
           Span(year)  = 4 periods
           (pid*year uniquely identifies each observation)

Distribution of T_i:   min      5%     25%       50%       75%     95%     max
                         1       1       3         4         4       4       4

     Freq.  Percent    Cum. |  Pattern
 ---------------------------+---------
     4792     57.91   57.91 |  1111
      746      9.02   66.92 |  111.
      419      5.06   71.99 |  ...1
      403      4.87   76.86 |  .111
      371      4.48   81.34 |  1...
      317      3.83   85.17 |  ..11
      255      3.08   88.25 |  11..
      192      2.32   90.57 |  ..1.
      172      2.08   92.65 |  11.1
      608      7.35  100.00 | (other patterns)
 ---------------------------+---------
     8275    100.00         |  XXXX

. 
. save "./final_data/OTT_media_panel.dta", replace
file ./final_data/OTT_media_panel.dta saved

. 
. log close
      name:  <unnamed>
       log:  /Users/doheun/Documents/Stata/IODS_2025/output/log/merge.log
  log type:  text
 closed on:   9 Dec 2025, 15:46:26
----------------------------------------------------------------------------------------------
