----------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/doheun/Documents/Stata/IODS_2025/output/log/summary.log
  log type:  text
 opened on:   9 Dec 2025, 16:04:19

. 
. use "./final_data/OTT_media_panel.dta", clear

. 
. 
. * 분석에 사용할 공통 샘플
. drop if D_spday1 == 1 | D_spday2 == 1 | D_spday3 == 1
(19 observations deleted)

. gen common_sample = 1

. replace common_sample = 0 if missing(m_OTT1)| m_OTT1 == 1 | missing(m_OTT2) | m_OTT2 == 1 | 
> missing(m_OTT3) | m_OTT3 == 1
(717 real changes made)

. 
. 
. * 연속변수 기술통계량
. su if common_sample == 1

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
         pid |     25,767    4.95e+07    3.75e+07      10001   1.18e+08
         hid |     25,767    494690.7    374864.6        100    1183300
        year |     25,767    22.48205     1.11023         21         24
        area |     25,767     7.25129    4.676352          1         17
    area_siz |     25,767    1.093802    .2915589          1          2
-------------+---------------------------------------------------------
     hhldsiz |     25,767    2.561299    .6608597          1          3
      gender |     25,767    1.462685    .4986153          1          2
       byear |     25,767    1967.825    17.06802       1919       2008
         age |     25,767    5.915667    1.576773          2          8
        age1 |     25,767    54.65727    17.09613         13        103
-------------+---------------------------------------------------------
      school |     25,767    4.146311    1.041378          2          6
         mar |     25,767    1.957271    .6528544          1          4
     income1 |     25,767    6.412077    2.966988          2         18
      income |     25,767    4.802887    1.554489          2          8
        job1 |     25,767     1.17992    .3841283          1          2
-------------+---------------------------------------------------------
        job2 |     21,131    1.432729    .8404449          1          4
        job3 |     21,131    50.05958    24.48511          1         99
        job4 |      4,636    2.791199    1.049568          1          4
OTT_week_h~r |     20,770    60.85339    53.93468          0        640
OTT_weeken~r |     20,770    84.77208    76.18546          0        630
-------------+---------------------------------------------------------
tvod_payment |     25,767    .0213354     .185104          0       3.75
svod_payment |     25,767    .3263865    .6523789          0       3.75
evod_payment |     25,767    .0506268    .3517558          0       3.75
contents_p~t |     25,767    .1028932      .28968          0       3.75
music_paym~t |     25,767    .1462627    .3099748          0       3.75
-------------+---------------------------------------------------------
game_payment |     25,767    .0829064    .3453671          0       3.75
 etc_payment |     25,767    .0014456    .0363972          0       3.25
       D_mm1 |     25,767    6.339349    .6045422          5          9
       D_dd1 |     25,767      14.858    8.558984          1         31
D_dayOfWeek1 |     25,767    3.921411    1.998232          1          7
-------------+---------------------------------------------------------
  D_weekend1 |     25,767    .2687934    .4433409          0          1
    D_spday1 |     25,767    4.968953    .2626274          2          5
 sleep_hour1 |     25,767    486.6178    79.37158        120       1080
working_ho~1 |     25,767    328.9842    269.3512          0       1110
   OTT_hour1 |     25,767    17.04098    42.53237          0        525
-------------+---------------------------------------------------------
 media_hour1 |     25,767    279.0738    161.2257         15       1020
composite_~1 |     25,767    328.2833     184.513          0       1050
       D_mm2 |     25,767    6.366399    .5987719          5          9
       D_dd2 |     25,767    15.03528     8.48516          1         31
D_dayOfWeek2 |     25,767    3.991268    1.977745          1          7
-------------+---------------------------------------------------------
  D_weekend2 |     25,767    .2814453    .4497129          0          1
    D_spday2 |     25,767    4.965382     .276026          2          5
 sleep_hour2 |     25,767    489.5023    81.89653        135       1020
working_ho~2 |     25,767      315.28    270.4523          0       1080
   OTT_hour2 |     25,767    17.39609    43.86328          0        795
-------------+---------------------------------------------------------
 media_hour2 |     25,767    281.2295    162.2569         15       1035
composite_~2 |     25,767    336.5922    185.1128          0       1110
       D_mm3 |     25,767    6.393488    .5945961          5         10
       D_dd3 |     25,767    15.22063    8.430116          1         31
D_dayOfWeek3 |     25,767    4.039974    1.985225          1          7
-------------+---------------------------------------------------------
  D_weekend3 |     25,767    .2891683     .453385          0          1
    D_spday3 |     25,767    4.963674    .2808266          2          5
 sleep_hour3 |     25,767    491.7848    84.31489         90       1035
working_ho~3 |     25,767    305.1898    271.3272          0       1095
   OTT_hour3 |     25,767    16.85179    43.45322          0        615
-------------+---------------------------------------------------------
 media_hour3 |     25,767    285.5431     162.118         15       1020
composite_~3 |     25,767    340.6305    185.6404          0       1080
   h_income1 |     25,767    10.94004    5.840949          1         22
   h_income2 |     25,767    4.642954    1.701933          1          6
      spouse |     25,767    .6646486    .4721223          0          1
-------------+---------------------------------------------------------
employment~e |     25,767    1.116738     .884699          0          3
        wage |     25,767    245.6039    148.3494         25        825
 OTT_payment |     25,767    .3477219      .68327          0        5.5
other_medi~t |     25,767    .3841347    .8244612          0         14
non_sleep_~1 |     25,767    953.3822    79.37158        360       1320
-------------+---------------------------------------------------------
total_medi~1 |     25,767    296.1148    161.4178         15       1140
      L_OTT1 |     25,767    .0179605    .0456281          0   .7428572
          H1 |     25,767    .3365063    .2749556          0        .95
L_composite1 |     25,767    .3474929      .19842          0   .9852941
    L_media1 |     25,767    .2980403    .1809436   .0119048          1
-------------+---------------------------------------------------------
      m_OTT1 |     25,767    .0606486    .1433928          0   .9411765
    m_media1 |     25,767    .9393514    .1433928   .0588235          1
non_sleep_~2 |     25,767    950.4977    81.89653        420       1305
total_medi~2 |     25,767    298.6256    162.4338         15       1035
      L_OTT2 |     25,767    .0184859    .0477229          0   .9464286
-------------+---------------------------------------------------------
          H2 |     25,767     .322317    .2760247          0   .9722222
L_composite2 |     25,767    .3576117    .2000869          0    .969697
    L_media2 |     25,767    .3015854    .1828943   .0131579          1
      m_OTT2 |     25,767     .061334    .1440138          0   .9636363
    m_media2 |     25,767     .938666    .1440138   .0363636          1
-------------+---------------------------------------------------------
non_sleep_~3 |     25,767    948.2152    84.31489        405       1350
total_medi~3 |     25,767    302.3949    162.4337         15       1020
      L_OTT3 |     25,767    .0179985    .0474828          0   .7916667
          H3 |     25,767    .3118693    .2767553          0   .9473684
L_composite3 |     25,767    .3628573    .2005432          0    .983871
-------------+---------------------------------------------------------
    L_media3 |     25,767    .3072748    .1838999   .0135135          1
      m_OTT3 |     25,767    .0586732    .1415476          0    .962963
    m_media3 |     25,767    .9413268    .1415476    .037037          1
log_total_~1 |     25,767    5.535749    .5906382    2.70805   7.038784
log_total_~2 |     25,767     5.54247    .5957564    2.70805   6.942157
-------------+---------------------------------------------------------
log_total_~3 |     25,767     5.55671    .5943983    2.70805   6.927558
      lnWage |     25,767    5.232172    .8637053   3.218876   6.715384
    alpha_O1 |     10,095    .4351368    .4777552          0          1
    alpha_I1 |     25,767    .0091298    .0264876          0   .6603774
    alpha_O2 |     10,224    .4329532    .4781188          0          1
-------------+---------------------------------------------------------
    alpha_I2 |     25,767    .0089913    .0258392          0   .6666667
    alpha_O3 |     10,061    .4467303    .4801144          0          1
    alpha_I3 |     25,767    .0089864    .0271258          0   .6511628
 year_month1 |     25,767    9.015989    4.805127          1         16
 year_month2 |     25,767     9.04304    4.805433          1         16
-------------+---------------------------------------------------------
 year_month3 |     25,767     10.3123    5.594301          1         18
      d26001 |     25,767     1.19393    .3953825          1          2
      d26015 |     20,770     9.34882    2.221841          1         21
      d26016 |      9,393    8.693389    4.043536          1         21
      d26017 |        852    7.678404    4.103806          1         15
-------------+---------------------------------------------------------
      d26018 |          0
      d26019 |          0
      d26020 |          0
      d26007 |     20,770       2.713     1.72449          1          8
      d26037 |     20,770    .7451613    1.005597          0         10
-------------+---------------------------------------------------------
      d26038 |     20,770    16.14372    15.00572          0         55
      d26041 |     20,770    1.171545     1.38194          0         10
      d26042 |     20,770    14.47935    15.46029          0         59
      d26045 |      4,900    3.196531    2.416591          1          9
      d26047 |      4,270      3.6637    2.409723          1          9
-------------+---------------------------------------------------------
      d26049 |      3,205    4.132605    2.490847          1          9
      d26046 |          0
      d26048 |          0
      d26050 |          0
      d26027 |      4,900    1.143878    .6788386          1          5
-------------+---------------------------------------------------------
      d26028 |      1,500    3.358667    1.369407          1          6
      d26029 |        492     3.50813    1.189711          1          5
      d26030 |          0
      d26031 |          0
      d26032 |          0
-------------+---------------------------------------------------------
      d26010 |     15,632    1.641952    .4794416          1          2
      d26011 |     15,632     1.28979    .4536794          1          2
      d26012 |     15,632    1.899629    .3005037          1          2
      d26013 |     15,632    1.721085      .44848          1          2
      d26051 |     20,770    1.173664    .3788294          1          2
-------------+---------------------------------------------------------
      d26052 |     20,770    1.976842      .15041          1          2
      d26053 |     20,770    1.681175    .4660324          1          2
      d26054 |     20,770           2           0          2          2
      d26034 |          0
      d26055 |        481     10.2869    8.125373          1        100
-------------+---------------------------------------------------------
      d26057 |      6,622    11.85352    7.685263          0        200
      d26059 |          0
      d26060 |          0
      d26071 |     15,870    1.888595    .3146431          1          2
      d26072 |     15,870    1.944045    .2298413          1          2
-------------+---------------------------------------------------------
      d26073 |      5,294    1.984511    .1234998          1          2
      d26074 |     15,870    1.986326    .1161356          1          2
      d26075 |     15,870    1.061059    .2394453          1          2
      d26076 |     15,870    1.982798    .1300285          1          2
      d26077 |     15,870    1.970258    .1698791          1          2
-------------+---------------------------------------------------------
      d26078 |     15,870    1.979836    .1405649          1          2
      d26079 |     15,870    1.995463    .0672054          1          2
      d26080 |     15,870    1.658475     .474236          1          2
      d26081 |     15,870    1.989036    .1041372          1          2
      d26082 |     15,870     1.99937    .0250951          1          2
-------------+---------------------------------------------------------
      d26083 |     15,870    1.960933    .1937615          1          2
      d26084 |     15,870    1.995715    .0653202          1          2
      d26085 |     15,870    1.997353    .0513777          1          2
      d26086 |     15,870    1.932136    .2515201          1          2
      d26087 |     15,870    1.999181    .0286101          1          2
-------------+---------------------------------------------------------
      d26088 |          0
      d26063 |     15,870    3.153119    2.400978          1         10
      d26064 |          0
      d26065 |     10,732    1.376817     1.11538          1          5
      d26066 |          0
-------------+---------------------------------------------------------
      d26067 |      7,239    2.762398    2.044251          1         10
      d26068 |          0
      d26069 |      4,676    2.028443     1.65269          1          5
      d26070 |          0
      d26040 |     15,870    2.867045    1.580042          1          7
-------------+---------------------------------------------------------
      d26044 |     15,870    3.529931    1.925045          1          7
      d26061 |      5,955    1.751805    .8916031          1          4
      d26062 |          0
      d26089 |      5,138    1.934216    .2479289          1          2
      d26090 |      5,138    1.920592    .2704013          1          2
-------------+---------------------------------------------------------
      d26091 |      5,138     1.99747     .050242          1          2
      d26092 |      5,138    1.346244    .4758183          1          2
common_sam~e |     25,767           1           0          1          1

. 
. 
. * 범주형 변수 기술통계량
. tab gender if common_sample == 1

    [개인정 |
   보] 성별 |      Freq.     Percent        Cum.
------------+-----------------------------------
         남 |     13,845       53.73       53.73
         여 |     11,922       46.27      100.00
------------+-----------------------------------
      Total |     25,767      100.00

. tab employment_type if common_sample == 1

    고용 형태 |      Freq.     Percent        Cum.
--------------+-----------------------------------
         무직 |      5,011       19.45       19.45
  임근 근로자 |     16,481       63.96       83.41
       고용주 |        531        2.06       85.47
단독 자영업자 |      3,744       14.53      100.00
--------------+-----------------------------------
        Total |     25,767      100.00

. tab school if common_sample == 1

      [개인정보] |
        최종학력 |      Freq.     Percent        Cum.
-----------------+-----------------------------------
       초졸 이하 |      3,236       12.56       12.56
       중졸 이하 |      2,214        8.59       21.15
       고졸 이하 |      8,301       32.22       53.37
       대졸 이하 |     11,576       44.93       98.29
대학원 재학 이상 |        440        1.71      100.00
-----------------+-----------------------------------
           Total |     25,767      100.00

. tab area_siz if common_sample == 1

    [가구정 |
        보] |
     지역구 |
         분 |      Freq.     Percent        Cum.
------------+-----------------------------------
       시부 |     23,350       90.62       90.62
       군부 |      2,417        9.38      100.00
------------+-----------------------------------
      Total |     25,767      100.00

. tab hhldsiz if common_sample == 1

    [가구정보 |
     ] 가구원 |
           수 |      Freq.     Percent        Cum.
--------------+-----------------------------------
     1인 가구 |      2,454        9.52        9.52
     2인 가구 |      6,396       24.82       34.35
3인 이상 가구 |     16,917       65.65      100.00
--------------+-----------------------------------
        Total |     25,767      100.00

. 
. ** 종속변수의 분포
. 
. forvalues day = 1/3 {
  2.         //1일차
.         histogram m_OTT`day', fcolor(blue) lcolor(blue) graphregion(fcolor(white)) ///
>                 aspectratio(1) ///
>                 saving("./output/graph/OTT`day'_total.gph", replace)
  3.         histogram m_OTT`day' if m_OTT`day' != 0, fcolor(blue) lcolor(blue) graphregion(fc
> olor(white)) ///
>                 aspectratio(1) ///
>                 saving("./output/graph/OTT`day'_0to1.gph", replace)
  4.                 
.         graph combine "./output/graph/OTT`day'_total.gph" "./output/graph/OTT`day'_0to1.gph"
  5.         graph export "./output/graph/dist_M_OTT`day'.png", replace
  6. }
(bin=44, start=0, width=.02272727)
file ./output/graph/OTT1_total.gph saved
(bin=37, start=.01923077, width=.02650728)
file ./output/graph/OTT1_0to1.gph saved
file /Users/doheun/Documents/Stata/IODS_2025/output/graph/dist_M_OTT1.png saved as PNG
    format
(bin=44, start=0, width=.02272727)
file ./output/graph/OTT2_total.gph saved
(bin=38, start=.02040816, width=.02577873)
file ./output/graph/OTT2_0to1.gph saved
file /Users/doheun/Documents/Stata/IODS_2025/output/graph/dist_M_OTT2.png saved as PNG
    format
(bin=44, start=0, width=.02272727)
file ./output/graph/OTT3_total.gph saved
(bin=37, start=.01960784, width=.02649709)
file ./output/graph/OTT3_0to1.gph saved
file /Users/doheun/Documents/Stata/IODS_2025/output/graph/dist_M_OTT3.png saved as PNG
    format

. 
. ** Diary data 기술통게량
. forvalues num = 1/3{
  2.         su H`num' L_composite`num' L_OTT`num' L_media`num' if D_weekend`num' == 1 & commo
> n_sample == 1
  3.         su H`num' L_composite`num' L_OTT`num' L_media`num' if D_weekend`num' == 0 & commo
> n_sample == 1
  4. }

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
          H1 |      6,926    .1389458    .2400554          0   .9350649
L_composite1 |      6,926    .4545601    .2081658          0   .9852941
      L_OTT1 |      6,926    .0242911    .0577878          0   .7428572
    L_media1 |      6,926    .3822029    .1947847   .0144928          1

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
          H1 |     18,841      .40913    .2501768          0        .95
L_composite1 |     18,841    .3081347    .1793119          0    .984127
      L_OTT1 |     18,841    .0156334    .0399958          0   .5384616
    L_media1 |     18,841    .2671019     .165135   .0119048          1

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
          H2 |      7,252    .1223858    .2296385          0    .968254
L_composite2 |      7,252    .4617215    .2064298          0    .969697
      L_OTT2 |      7,252    .0255368    .0609763          0   .9464286
    L_media2 |      7,252     .390356    .1956281   .0144928          1

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
          H2 |     18,515    .4006266    .2521709          0   .9722222
L_composite2 |     18,515    .3168337     .181985          0   .9666666
      L_OTT2 |     18,515    .0157242    .0410642          0   .6956522
    L_media2 |     18,515    .2668155    .1651322   .0131579          1

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
          H3 |      7,451    .1116157    .2214551          0   .9473684
L_composite3 |      7,451     .467305    .2027258          0   .9836066
      L_OTT3 |      7,451    .0257715    .0620794          0   .6153846
    L_media3 |      7,451    .3953078    .1944316   .0147059          1

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
          H3 |     18,316    .3933331    .2546637          0   .9473684
L_composite3 |     18,316    .3203677    .1833523          0    .983871
      L_OTT3 |     18,316    .0148365    .0396187          0   .7916667
    L_media3 |     18,316    .2714627    .1666279   .0135135          1

. 
. 
. // 단순 선형관계는 보고 싶은 부분을 포착하지 못함.
. twoway scatter L_OTT1 L_media1

. twoway scatter L_OTT2 L_media2

. twoway scatter L_OTT3 L_media3

. 
. log close
      name:  <unnamed>
       log:  /Users/doheun/Documents/Stata/IODS_2025/output/log/summary.log
  log type:  text
 closed on:   9 Dec 2025, 16:04:31
----------------------------------------------------------------------------------------------
